---
kind: method
id: M:Autodesk.Revit.DB.LinePattern.SetSegments(System.Collections.Generic.IList{Autodesk.Revit.DB.LinePatternSegment})
source: html/7839298c-90e6-f855-8ec5-269400a45daf.htm
---
# Autodesk.Revit.DB.LinePattern.SetSegments Method

Sets the sequence of segments that defines this line pattern.

## Syntax (C#)
```csharp
public void SetSegments(
	IList<LinePatternSegment> lineSegs
)
```

## Parameters
- **lineSegs** (`System.Collections.Generic.IList < LinePatternSegment >`) - The sequence of segments.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null